app/views/users/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "user_courses" ON "courses"."id" = "user_courses"."course_id" WHERE "user_courses"."user_id" = ?  [["user_id", 1]]
---
<ol>
<% @user.courses.each do |c| %>