app/views/courses/show.html.erb

SELECT "units".* FROM "units" WHERE "units"."course_id" = ?  [["course_id", 1]]
---

    <% @course.units.each do |unit| %>