app/controllers/units_controller.rb

   def set_course
    @course= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @course= Course.find(params[:course_id])
    @units = @course.units.all
---
SELECT "units".* FROM "units" WHERE "units"."course_id" = ?  [["course_id", 1]]

  def show
    @course= Course.find(params[:course_id])
   @unit= @course.units.find(params[:id])
   current_user.courses << @course unless current_user.courses.include?(@course)
---
SELECT  "units".* FROM "units" WHERE "units"."course_id" = ? AND "units"."id" = ? LIMIT 1  [["course_id", 1], ["id", 1]]
INSERT INTO "user_courses" ("user_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["course_id", 1], ["created_at", "2016-04-18 18:34:44.568535"], ["updated_at", "2016-04-18 18:34:44.568535"]]
SELECT  1 AS one FROM "courses" INNER JOIN "user_courses" ON "courses"."id" = "user_courses"."course_id" WHERE "user_courses"."user_id" = ? AND "courses"."id" = ? LIMIT 1  [["user_id", 2], ["id", 1]]

  def edit
    @course= Course.find(params[:course_id])
    @unit= @course.units.find(params[:id])
---
SELECT  "units".* FROM "units" WHERE "units"."course_id" = ? AND "units"."id" = ? LIMIT 1  [["course_id", 1], ["id", 1]]

  def create
    @course= Course.find(params[:course_id])

    @unit=@course.units.new(unit_params)

    @course.save
---
INSERT INTO "units" ("description", "name", "content", "simulator", "answer", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def compare
    @course = Course.find(params[:course_id])
    @unit = @course.units.find(params[:id])
    simulador = params[:simulador]

    respuesta = @unit.answer.downcase.gsub(/\s+/, "") == simulador.downcase.gsub(/\s+/, "")
    if respuesta
      current_user.units << @unit unless current_user.units.include?(@unit)
---
SELECT  "units".* FROM "units" WHERE "units"."course_id" = ? AND "units"."id" = ? LIMIT 1  [["course_id", 1], ["id", 1]]
INSERT INTO "user_units" ("user_id", "unit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["unit_id", 1], ["created_at", "2016-04-18 21:19:09.596983"], ["updated_at", "2016-04-18 21:19:09.596983"]]
SELECT  1 AS one FROM "units" INNER JOIN "user_units" ON "units"."id" = "user_units"."unit_id" WHERE "user_units"."user_id" = ? AND "units"."id" = ? LIMIT 1  [["user_id", 2], ["id", 1]]

  def update
    @unit= @course.units.find(params[:id])
    @unit.update(unit_params)
---
SELECT  "units".* FROM "units" WHERE "units"."course_id" = ? AND "units"."id" = ? LIMIT 1  [["course_id", 1], ["id", 1]]
UPDATE "units" SET "description" = ?, "answer" = ?, "updated_at" = ? WHERE "units"."id" = ?  [["description", "Que harías si los robots fueran inteligentes ?"], ["answer", ""], ["updated_at", "2016-04-20 18:37:33.018201"], ["id", 1]]