app/controllers/users_controller.rb

  def show
    @user = User.find_by_nickname(params[:nickname])
---
SELECT  "users".* FROM "users" WHERE "users"."nickname" = ? LIMIT 1  [["nickname", "laugarcia"]]